In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from matplotlib.pylab import mpl
import json
import operator # for sort diction by value
#from sets import Set
from datetime import date, time, datetime
#import readfromfile
import sys
mpl.rcParams['font.sans-serif'] = ['SimHei']
%matplotlib inline

In [2]:
dorm_data=pd.read_table(r'E:/BaiduNetdiskDownload/jzzz/train/dorm_train.txt', sep = ',', quotechar =',',
                          names = ['user_id','time','in&out',],
                          encoding='utf-8',header=None)
dorm_data.head()
#0表示进寝室，1表示出寝室

   user_id                   time in&out
0    13126  "2014/01/21 03:31:11"    "1"
1    13126  "2014/01/21 04:53:55"    "0"
2    18484  "2014/01/21 05:16:18"    "1"
3      296  "2014/01/21 05:55:05"    "1"
4     9760  "2014/01/21 08:44:53"    "1"

In [5]:
#dorm_data.index
#len(dorm_data.user_id.unique())
#dorm_data.info()

In [11]:
#以“user_id”进行排序,总共的出入次数
#dorm_data1=dorm_data.groupby(['user_id'])['time'].count()
#dorm_data1

In [22]:
dorm_data['hour']=dorm_data['time'].str[12:14]  #截取出入的小时
dorm_data[['hour']]
dorm_data[:10]

   user_id                   time in&out        date month hour     time1
0    13126  "2014/01/21 03:31:11"    "1"  2014/01/21    01   03  03:31:11
1    13126  "2014/01/21 04:53:55"    "0"  2014/01/21    01   04  04:53:55
2    18484  "2014/01/21 05:16:18"    "1"  2014/01/21    01   05  05:16:18
3      296  "2014/01/21 05:55:05"    "1"  2014/01/21    01   05  05:55:05
4     9760  "2014/01/21 08:44:53"    "1"  2014/01/21    01   08  08:44:53
5     6778  "2014/01/21 09:21:33"    "1"  2014/01/21    01   09  09:21:33
6    18200  "2014/01/21 09:50:07"    "1"  2014/01/21    01   09  09:50:07
7     8894  "2014/01/21 10:09:52"    "1"  2014/01/21    01   10  10:09:52
8     9228  "2014/01/21 10:28:23"    "0"  2014/01/21    01   10  10:28:23
9     6778  "2014/01/21 10:36:06"    "0"  2014/01/21    01   10  10:36:06

In [23]:
dorm_data['hour']=dorm_data['hour'].astype('int')  #将hour列改为数字类型

In [63]:
###???
timeCritera = ['00_00', '01_00', '03_00', '06_00', '09_00', '11_20', '12_50', '16_50', '19_00', '22_00', '24_00']

In [13]:
#拆分为日期+时间
#接下来加工salary薪资字段。目的是计算出薪资下限以及薪资上限
#用截取字符串也可以
def cut_word(word):
    position = word.find(' ')
    if position != -1:
        date=word[1: position]
        time1=word[position+1:-1]
    return date

In [14]:
def cut_word2(word):
    position = word.find(' ')
    if position != -1:
        time1=word[position+1:-1]
    return time1

In [15]:
dorm_data['month']=dorm_data['time'].str[6:8]  #截取出入的月份
dorm_data.head()

   user_id                   time in&out month
0    13126  "2014/01/21 03:31:11"    "1"    01
1    13126  "2014/01/21 04:53:55"    "0"    01
2    18484  "2014/01/21 05:16:18"    "1"    01
3      296  "2014/01/21 05:55:05"    "1"    01
4     9760  "2014/01/21 08:44:53"    "1"    01

In [24]:
dorm_data['date']=dorm_data.time.apply(cut_word)
dorm_data['time1']=dorm_data.time.apply(cut_word2)
dorm_data.head()

   user_id                   time in&out        date month  hour     time1
0    13126  "2014/01/21 03:31:11"    "1"  2014/01/21    01     3  03:31:11
1    13126  "2014/01/21 04:53:55"    "0"  2014/01/21    01     4  04:53:55
2    18484  "2014/01/21 05:16:18"    "1"  2014/01/21    01     5  05:16:18
3      296  "2014/01/21 05:55:05"    "1"  2014/01/21    01     5  05:55:05
4     9760  "2014/01/21 08:44:53"    "1"  2014/01/21    01     8  08:44:53

In [25]:
dorm_data.dtypes

user_id     int64
time       object
in&out     object
date       object
month      object
hour        int32
time1      object
dtype: object

In [26]:
dorm_data=pd.DataFrame(dorm_data,columns=['user_id','time', 'in&out', 'date','month','hour','time1'])
dorm_data.head()

   user_id                   time in&out        date month  hour     time1
0    13126  "2014/01/21 03:31:11"    "1"  2014/01/21    01     3  03:31:11
1    13126  "2014/01/21 04:53:55"    "0"  2014/01/21    01     4  04:53:55
2    18484  "2014/01/21 05:16:18"    "1"  2014/01/21    01     5  05:16:18
3      296  "2014/01/21 05:55:05"    "1"  2014/01/21    01     5  05:55:05
4     9760  "2014/01/21 08:44:53"    "1"  2014/01/21    01     8  08:44:53

In [27]:
#出入的次数高峰
dorm_data.month.unique()

array(['01', '02', '03', '04', '05', '06', '07', '08'], dtype=object)

In [42]:
dorm_data.date=pd.to_datetime(dorm_data['date'])
dorm_data.info() ###

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2115064 entries, 0 to 2115063
Data columns (total 7 columns):
user_id    int64
time       object
in&out     object
date       datetime64[ns]
month      object
hour       int32
time1      object
dtypes: datetime64[ns](1), int32(1), int64(1), object(4)
memory usage: 104.9+ MB

In [44]:
dorm_data['date'].max()

AttributeError: 'Timestamp' object has no attribute 'days'